dima2/src/InformationRegisters/СвязанностьЛицКонтролируемыхОпераций/СвязанностьЛицКонтролируемыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанностьЛицКонтролируемыхОпераций</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресВКонтракте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Страна</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <comment>резидент (&quot;Р&quot;) - нерезидент(&quot;Н&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <comment>КодДРФО, КодЕДРПОУ, номер паспорта или код регистрации нерезидента в стране резиденции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСвязанностиЛиц1</name>
    <comment>Додаток 2 порядку складання звіту про контрольовані операції - 501...510</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСвязанностиЛиц2</name>
    <comment>Додаток 2 порядку складання звіту про контрольовані операції - 501...510</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСвязанностиЛиц3</name>
    <comment>Додаток 2 порядку складання звіту про контрольовані операції - 501...510</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСвязанностиЛиц4</name>
    <comment>Додаток 2 порядку складання звіту про контрольовані операції - 501...510</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКонтролируемойОперации1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКонтролируемойОперации2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКонтролируемойОперации3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКонтролируемойОперации4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Код501_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код502_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код503_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код504_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код505_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код506_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код507_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Код508_2016</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

dima2/src/InformationRegisters/СвязанностьЛицКонтролируемыхОпераций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКодовСвязанности = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыСвязанностиКонтрагентов();
	Для каждого ЭлементСпискаКодовСвязанности Из СписокКодовСвязанности Цикл
		Элементы.КодСвязанностиЛиц1.СписокВыбора.Добавить(ЭлементСпискаКодовСвязанности.Значение, ЭлементСпискаКодовСвязанности.Представление);
		Элементы.КодСвязанностиЛиц2.СписокВыбора.Добавить(ЭлементСпискаКодовСвязанности.Значение, ЭлементСпискаКодовСвязанности.Представление);
		Элементы.КодСвязанностиЛиц3.СписокВыбора.Добавить(ЭлементСпискаКодовСвязанности.Значение, ЭлементСпискаКодовСвязанности.Представление);
		Элементы.КодСвязанностиЛиц4.СписокВыбора.Добавить(ЭлементСпискаКодовСвязанности.Значение, ЭлементСпискаКодовСвязанности.Представление);
	КонецЦикла;
	
	СписокКодовОпераций = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыОпераций();
	Для каждого ЭлементСпискаКодовОпераций Из СписокКодовОпераций Цикл
		Элементы.КодКонтролируемойОперации1.СписокВыбора.Добавить(ЭлементСпискаКодовОпераций.Значение, ЭлементСпискаКодовОпераций.Представление);
		Элементы.КодКонтролируемойОперации2.СписокВыбора.Добавить(ЭлементСпискаКодовОпераций.Значение, ЭлементСпискаКодовОпераций.Представление);
		Элементы.КодКонтролируемойОперации3.СписокВыбора.Добавить(ЭлементСпискаКодовОпераций.Значение, ЭлементСпискаКодовОпераций.Представление);
		Элементы.КодКонтролируемойОперации4.СписокВыбора.Добавить(ЭлементСпискаКодовОпераций.Значение, ЭлементСпискаКодовОпераций.Представление);
	КонецЦикла;
	
	Если Параметры.Ключ.Контрагент.Пустая() Тогда
		Статус = "Р";
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПрочитатьДанные(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДаные();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Код501 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "501" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "501"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "501" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "501" Тогда
		Код501 = Истина;	
	КонецЕсли;	
	
	Код502 = Ложь;
	Если 	 Запись.КодСвязанностиЛиц1 = "502" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "502"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "502"
		 ИЛИ Запись.КодСвязанностиЛиц4 = "502" Тогда
		Код502 = Истина;	
	КонецЕсли;	
	
	Код503 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "503" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "503"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "503" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "503"  Тогда
		 Код503 = Истина;
	КонецЕсли;
	
	Код504 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "504" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "504"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "504" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "504"  Тогда
		 Код504 = Истина;
	КонецЕсли;

	Код505 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "505" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "505"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "505" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "505"  Тогда
		 Код505	 = Истина;
	КонецЕсли;
	
	Код506 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "506" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "506"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "506" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "506"  Тогда
		 Код506 = Истина;
	КонецЕсли;
	
	Код507 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "507" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "507"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "507" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "507"  Тогда
		 Код507 = Истина;
	КонецЕсли;
	
	Код508 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "508" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "508"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "508" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "508"  Тогда
		 Код508 = Истина;
	КонецЕсли;
	
	Код509 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "509" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "509"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "509" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "509"  Тогда
		 Код509 = Истина;
	КонецЕсли;
	
	Код510 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "510" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "510"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "510" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "510"  Тогда
		 Код510 = Истина;
	КонецЕсли;
	
	Код513 = Ложь;
	Если     Запись.КодСвязанностиЛиц1 = "513" 
		 ИЛИ Запись.КодСвязанностиЛиц2 = "513"
		 ИЛИ Запись.КодСвязанностиЛиц3 = "513" 
		 ИЛИ Запись.КодСвязанностиЛиц4 = "513"  Тогда
		 Код513 = Истина;
	КонецЕсли;
	
	Элементы.Связанность501_2016.Видимость = Код501 ИЛИ Код509;
	Элементы.Связанность502_2016.Видимость = Код502;
	Элементы.Связанность503_2016.Видимость = Код503;
	Элементы.Связанность504_2016.Видимость = Код504;
	Элементы.Связанность505_2016.Видимость = Код505;
	Элементы.Связанность506_2016.Видимость = Код506;
	Элементы.Связанность507_2016.Видимость = Код507;
	Элементы.Связанность508_2016.Видимость = Код508 ИЛИ Код513;
	
	Элементы.СвязанностьНетНастроек_2016.Видимость = НЕ (Код501 ИЛИ Код502 ИЛИ Код503 ИЛИ Код504 ИЛИ Код505 ИЛИ Код506 ИЛИ Код507 ИЛИ Код508 ИЛИ Код509 ИЛИ Код513);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанные(ТекущийОбъект)

	ВариантыСвязей = Новый СписокЗначений;
	ВариантыСвязей.Добавить("2016");
	
	Для каждого ВариантСвязи Из ВариантыСвязей Цикл
		
		Год = ВариантСвязи.Значение;
		Для КодСвязи = 501 по 513  Цикл
			
			Если Год = "2016" И КодСвязи > 508 Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяХранилища 		= "Код" + КодСвязи + "_" + Год; 
			
			СтруктураНастроек = ТекущийОбъект[ИмяХранилища].Получить();
			
			Если СтруктураНастроек = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого ЭлементНастройки Из СтруктураНастроек Цикл
				
				ИмяЭлемента = ЭлементНастройки.Ключ;
				
				Попытка
				
					ЭлФормы = Элементы[ИмяЭлемента];
					
					Если  ТипЗнч(ЭлФормы) = Тип("ПолеФормы") Тогда
						
						ВидЭлемента = ЭлФормы.Вид;
						Если ВидЭлемента = ВидПоляФормы.ПолеФлажка Тогда
							ЭтаФорма[ИмяЭлемента] = ЭлементНастройки.Значение;
						ИначеЕсли ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда
							Если Не ПустаяСтрока(ЭлементНастройки.Значение) Тогда
								ЭтаФорма[ИмяЭлемента] = ЭлементНастройки.Значение;
							КонецЕсли;
						КонецЕсли;
						
					ИначеЕсли ТипЗнч(ЭлФормы) = Тип("ТаблицаФормы") Тогда
						
						ЗначениеВДанныеФормы(ЭлементНастройки.Значение.Получить(), ЭтаФорма[ИмяЭлемента]);
						
					КонецЕсли;
					
				Исключение 
				КонецПопытки;
			
			КонецЦикла;	
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДаные()

	МенеджерЗаписи = РегистрыСведений.СвязанностьЛицКонтролируемыхОпераций.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	
	ВариантыСвязей = Новый СписокЗначений;
	ВариантыСвязей.Добавить("2016");
	
	Для каждого ВариантСвязи Из ВариантыСвязей Цикл
		
		Год = ВариантСвязи.Значение;
		
		Для КодСвязи = 501 по 513  Цикл
			
			Если Год = "2016" И КодСвязи > 508 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураНастроек 	= Новый Структура;
			ИмяХранилища 		= "Код" + КодСвязи + "_" + Год; 
			ТипТаблица = Новый ОписаниеТипов("ТаблицаЗначений");
			
			Для каждого ЭлФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
				
				ИмяЭлемента = ЭлФОрмы.Имя;
				
				Если  Найти(ИмяЭлемента, ИмяХранилища) > 0 Тогда
					
					Если ЭлФормы.ТипЗначения = ТипТаблица Тогда
					
						СтруктураНастроек.Вставить(ИмяЭлемента, Новый ХранилищеЗначения(ДанныеФормыВЗначение(ЭтаФорма[ИмяЭлемента], Тип("ТаблицаЗначений")))); 
						
					Иначе
						
						СтруктураНастроек.Вставить(ИмяЭлемента, ЭтаФорма[ИмяЭлемента]); 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			МенеджерЗаписи[ИмяХранилища] = Новый ХранилищеЗначения(СтруктураНастроек);
		
		КонецЦикла;
		
	КонецЦикла;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСвязанностиЛицПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере(Запись.Контрагент, Запись.Код, Запись.Статус);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтрагентПриИзмененииНаСервере(Контрагент, Код, Статус)
	
	Код = Контрагент.КодПоЕДРПОУ;
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Статус = "Н";
	Иначе
		Статус = "Р";
	КонецЕсли;
	
КонецПроцедуры
